
&НаСервере
Процедура ПроверитьНаСервере()

	Определение = Новый WSОпределения("http://vld-app06.hq.fesco.com:9000/SOAPService?singleWsdl");
	
	Попытка
		
		Прокси = Новый WSПрокси(Определение, "http://tempuri.org/", "EDService", "BasicHttpBinding_IEDService",, 15);
		
		Сообщить(Прокси.IsRegistered(GUID, ПорядковыйНомер));		
		
	Исключение
		
		Сообщить(ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	ПроверитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИсправитьНаСервере()
	    	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВМТП_ДО2.Ссылка КАК Ссылка,
		|	ВМТП_ДО2.ПорядковыйНомер КАК ПорядковыйНомер,
		|	ВМТП_ДО2.ДО1.ДляТаможниGUID КАК GUID
		|ИЗ
		|	Документ.ВМТП_ДО2 КАК ВМТП_ДО2
		|ГДЕ
		|	ВМТП_ДО2.Проведен
		|	И ВМТП_ДО2.Статус В (ЗНАЧЕНИЕ(Перечисление.ВМТП_СтатусыОбменаСТаможней.Предоставлен), ЗНАЧЕНИЕ(Перечисление.ВМТП_СтатусыОбменаСТаможней.КОтправке))
		|	И ВМТП_ДО2.Дата < НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВМТП_ДО1.Ссылка,
		|	0,
		|	ВМТП_ДО1.ДляТаможниGUID
		|ИЗ
		|	Документ.ВМТП_ДО1 КАК ВМТП_ДО1
		|ГДЕ
		|	ВМТП_ДО1.Проведен
		|	И ВМТП_ДО1.Статус = ЗНАЧЕНИЕ(Перечисление.ВМТП_СтатусыОбменаСТаможней.Предоставлен)
		|	И ВМТП_ДО1.Дата < НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Не ПроверитьРегистрацию(ВыборкаДетальныеЗаписи.GUID, ВыборкаДетальныеЗаписи.ПорядковыйНомер) ТОгда
			Продолжить;
		КонецЕсли;
		НачатьТранзакцию();
		Попытка
		ВМТП_ТаможняВызовСервера.УстановитьСтатусДокумента(ВыборкаДетальныеЗаписи.Ссылка, ВМТП_ТаможняВызовСервераПовтИсп.ПолучитьСтатусЗарегистрирован());
		РегистрыСведений.ВМТП_СтатусыДО1ДО2КоммерческихАктов.ДобавитьКомментарийКПоследнемуСтатусу(ВыборкаДетальныеЗаписи.Ссылка, ВМТП_ТаможняВызовСервераПовтИсп.ПолучитьСтатусЗарегистрирован(), "Установлен обработкой по зависшим статусам ""Предоставлен"" документов таможни. В мониторе ЭД Документ ранее зарегистрирован");
		ЗафиксироватьТранзакцию();
		Сообщить(ВыборкаДетальныеЗаписи.Ссылка);
	Исключение
		ОтменитьТранзакцию();
		Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Исправить(Команда)
	ИсправитьНаСервере();
КонецПроцедуры


&НаСервере
Функция ПроверитьРегистрацию(Гуид, _ПорядковыйНомер)

	Определение = Новый WSОпределения("http://vld-app06.hq.fesco.com:9000/SOAPService?singleWsdl");
	
	//Попытка
		
		Прокси = Новый WSПрокси(Определение, "http://tempuri.org/", "EDService", "BasicHttpBinding_IEDService",, 15);
		
		Возврат Прокси.IsRegistered(Гуид, _ПорядковыйНомер);		
		
	//Исключение
	//	
	//	Сообщить(ОписаниеОшибки());
	//	
	//КонецПопытки;
	
КонецФункции
