&НаСервере
Функция  ОбработатьТабличныйДокумент(ШаблонСДанными, ВысотаШапки, ТекстОбработкиСервер) 
	Шаблон = Новый ТабличныйДокумент;
	Для НомерКолонки = 1 По ШаблонСДанными.ШиринаТаблицы Цикл   // копируем шапку табдок в новую
		Ячейка = ШаблонСДанными.ПолучитьОбласть(1, НомерКолонки, 1, НомерКолонки).ТекущаяОбласть;
		Имя = "R1C"+Формат(НомерКолонки,"ЧН=; ЧГ=0");
		Шаблон.ВставитьОбласть(Ячейка, Шаблон.Область(Имя+":"+Имя),ТипСмещенияТабличногоДокумента.БезСмещения,ИСТИНА);
	КонецЦикла;
	Для НомерСтроки = ВысотаШапки + 1 По ШаблонСДанными.ВысотаТаблицы Цикл
		МассивСтрок = Новый Массив;
		МассивЯчеек = Новый Массив;
		Для НомерКолонки = 1 По ШаблонСДанными.ШиринаТаблицы Цикл
			Ячейка = ШаблонСДанными.ПолучитьОбласть(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки).ТекущаяОбласть;
			Ячейка.Защита = Ложь;
			Имя = "R"+Формат(НомерСтроки,"ЧН=; ЧГ=0")+"C"+Формат(НомерКолонки,"ЧН=; ЧГ=0");
			Шаблон.ВставитьОбласть(Ячейка, Шаблон.Область(Имя+":"+Имя),ТипСмещенияТабличногоДокумента.БезСмещения,ИСТИНА);
			МассивЯчеек.Добавить(Ячейка);
			МассивСтрок.Добавить(Ячейка.Текст);
		КонецЦикла;
		Выполнить(ТекстОбработкиСервер);
	КонецЦикла;
	Возврат Шаблон;	
КонецФункции


&НаКлиенте
Процедура Обработать(Команда)
	ШаблонСДанными = ОбработатьТабличныйДокумент(ШаблонСДанными, 1, ВыполнитьКодДляСтроки);
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Если ПустаяСтрока(ВыполнитьКодДляСтроки)Тогда
	ВыполнитьКодДляСтроки = "//Доступные переменные:
	|//НомерСтроки - число, номер строки для обработки
	|//МассивЯчеек - массив областей ячеек текущей строки табличного поля 
	|//МассивСтрок - массив текстов ячеек текущей строки табличного поля
	|//ШаблонСДанными - исходное поле табличного документа
	|//Шаблон - поле табличного документа куда копируются данные после обработки
	|// ------------------------------------------------------------------------------------------------------------------------------------------
	|//Сообщить(""Строка ""+Строка(НомерСтроки)+""."");
	|ЗначениеКолонки1 = МассивСтрок.Получить(0); // так можно получить текст в ячейке первой колонке
	|Сообщить(ЗначениеКолонки1);
	|Ячейка1 = МассивЯчеек.Получить(0); //Можно так получить область 1 колонки
	|Ячейка3 = ШаблонСДанными.ПолучитьОбласть(НомерСтроки, 3, НомерСтроки, 3).ТекущаяОбласть;  // или так
	|Ячейка3.Текст = ""Пройден"";
	|Шаблон.ВставитьОбласть(Ячейка3, Шаблон.Область(НомерСтроки, 4, НомерСтроки, 4),ТипСмещенияТабличногоДокумента.БезСмещения,ИСТИНА); //записываем обратно в таблицу текст ";
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоСтрокДляОбработкиШаблонСДаннымиПриИзмененииНаСервере()
	Возврат  ШаблонСДанными.ВысотаТаблицы-1;
КонецФункции

&НаКлиенте
Процедура ШаблонСДаннымиПриИзменении(Элемент)
	КоличествоСтрокДляОбработки = ПолучитьКоличествоСтрокДляОбработкиШаблонСДаннымиПриИзмененииНаСервере();
	Элементы.ШаблонСДанными.Заголовок = "В таблице "+Формат(КоличествоСтрокДляОбработки,"ЧДЦ=0; ЧН=; ЧГ=0")+" строк для обработки";
КонецПроцедуры
